SFD_FLAMELET_JETMAP_PILTURB/system/sampleDict_inlet
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFormat   raw;

interpolationScheme cell;

// Fields to sample.
fields
(
// average of filtered value
    UMean       UPrime2Mean
);

surfaces
(
    xD00
    {
        type        patch;
        patches     ("fuel|pilot|coflow|inletwall");
        intepolate  true;
    }
);

// *********************************************************************** //
