SFD_FLAMELET_JETMAP_PILTURB/system/sampleDict_xD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

diam   0.0072;

x01    #calc "$diam*1.0";
x02    #calc "$diam*2.0";
x03    #calc "$diam*3.0";
x075   #calc "$diam*7.5";
x15    #calc "$diam*15.0";
x30    #calc "$diam*30.0";            
x45    #calc "$diam*45.0";            
x60    #calc "$diam*60.0";            
x75    #calc "$diam*75.0";            
x80    #calc "$diam*80.0";            

surfaceFormat   raw;
setFormat       raw;

// interpolationScheme. choice of
//      cell          : use cell-centre value only; constant over cells
//                      (default)
//      cellPoint     : use cell-centre and vertex values
//      cellPointFace : use cell-centre, vertex and face values.
//      pointMVC      : use point values only (Mean Value Coordinates)
//      cellPatchConstrained : like 'cell' but uses cell-centre except on
//                             boundary faces where it uses the boundary value.
//                             For use with e.g. patchCloudSet.
// 1] vertex values determined from neighbouring cell-centre values
// 2] face values determined using the current face interpolation scheme
//    for the field (linear, gamma, etc.)
interpolationScheme cell;

// Fields to sample.
fields
(
// average of filtered value
    UMean       UPrime2Mean
    TMean       TPrime2Mean
    ZMean       ZPrime2Mean
    varZMean    varZPrime2Mean
    chiMean     chiPrime2Mean
    COMean      COPrime2Mean
    CO2Mean     CO2Prime2Mean
    CH4Mean     CH4Prime2Mean
    H2OMean     H2OPrime2Mean
    O2Mean      O2Prime2Mean
    OHMean      OHPrime2Mean
    H2Mean      H2Prime2Mean
    NOMean      NOPrime2Mean
    N2Mean      N2Prime2Mean

// instantaneous data for scatter plot and conditional mean
    Z varZ T CH4 O2 H2O CO2 CO OH H2 NO N2

);

// Set sampling definition: choice of
//      uniform             evenly distributed points on line
//      face                one point per face intersection
//      midPoint            one point per cell, inbetween two face intersections
//      midPointAndFace     combination of face and midPoint
//
//      polyLine            specified points, not nessecary on line, uses
//                          tracking
//      cloud               specified points, uses findCell
//      triSurfaceMeshPointSet  points of triSurface
//
// axis: how to write point coordinate. Choice of
// - x/y/z: x/y/z coordinate only
// - xyz: three columns
//  (probably does not make sense for anything but raw)
// - distance: distance from start of sampling line (if uses line) or
//             distance from first specified sampling point
//
// type specific:
//      uniform, face, midPoint, midPointAndFace : start and end coordinate
//      uniform: extra number of sampling points
//      polyLine, cloud: list of coordinates
//      patchCloud: list of coordinates and set of patches to look for nearest
//      patchSeed: random sampling on set of patches. Points slightly off
//                 face centre.
//sets
//(
//    axis 
//    {
//        type        face;
//        axis        z;
//        start       (0.0 0.0 0.0 );
//        end         (0.0 0.0 $x80);
//    }
//
//);

xDPlane
{
    type            plane;
    interpolate     true;
    normalVector    ( 0 0 1 );
}

surfaces
(
    xD01
    {
        $xDPlane;
        basePoint   ( 0 0 $x01 );
    }
    xD02
    {
        $xDPlane;
        basePoint   ( 0 0 $x02 );
    }
    xD03
    {
        $xDPlane;
        basePoint   ( 0 0 $x03 );
    }
    xD075
    {
        $xDPlane;
        basePoint   ( 0 0 $x075 );
    }
    xD15
    {
        $xDPlane;
        basePoint   ( 0 0 $x15 );
    }
    xD30
    {
        $xDPlane;
        basePoint   ( 0 0 $x30 );
    }
    xD45
    {
        $xDPlane;
        basePoint   ( 0 0 $x45 );
    }
);

// *********************************************************************** //
